Revit 2027 API
ZoneEquipmentData.HotWaterLoopId Property
 The water loop element id for the hot-water heating coil.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId HotWaterLoopId { get; set; }
Public Property HotWaterLoopId As ElementId
	Get
	Set
public:
property ElementId^ HotWaterLoopId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member HotWaterLoopId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ZoneEquipmentData Class
Autodesk.Revit.DB.Mechanical Namespace